Revit 2027 API
BoundaryConditions.CanCreateAreaBoundaryConditions Method
 Checks if the provided host can host an area boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanCreateAreaBoundaryConditions(
	Document doc,
	Reference reference,
	bool isConstrainedOnHost,
	IList<CurveLoop> loops
)
Public Shared Function CanCreateAreaBoundaryConditions (
	doc As Document,
	reference As Reference,
	isConstrainedOnHost As Boolean,
	loops As IList(Of CurveLoop)
) As Boolean
public:
static bool CanCreateAreaBoundaryConditions(
	Document^ doc,
	Reference^ reference,
	bool isConstrainedOnHost,
	IList<CurveLoop^>^ loops
)
static member CanCreateAreaBoundaryConditions :
        doc : Document *
        reference : Reference *
        isConstrainedOnHost : bool *
        loops : IList<CurveLoop> -> bool
Parameters
doc Document
 The document containing both the host and the boundary conditions.
reference Reference
 A reference to an analytical element.
isConstrainedOnHost Boolean
 A value indicating if the area boundary conditions is constrained on host or not.
loops IList<CurveLoop>
 The loops that define geometry of the area boundary conditions. This is taken into account only if isConstrainedOnHost is false.
Return Value
Boolean
 True if an area boundary conditions can be placed on the input host.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace